cats99/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["sex", "F"], ["updated_at", "2023-02-20 00:34:10.869079"], ["id", 4]]